garyPenhook/PIC-Assembler/edc/PIC18F47Q43.PIC
        <edc:SFRDef edc:access="-----nnn" edc:cname="DMA4PR" edc:desc="" edc:impl="0x7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----111" edc:name="DMA4PR" edc:nzwidth="8" edc:por="-----111" edc:_addr="0xB9">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PR" edc:mask="0x7" edc:name="PR" edc:nzwidth="3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="PR0" edc:mask="0x1" edc:name="PR0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PR1" edc:mask="0x1" edc:name="PR1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PR2" edc:mask="0x1" edc:name="PR2" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="DMA4PR" edc:mask="0x7" edc:name="DMA4PR" edc:nzwidth="3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="DMA4PR0" edc:mask="0x1" edc:name="DMA4PR0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DMA4PR1" edc:mask="0x1" edc:name="DMA4PR1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DMA4PR2" edc:mask="0x1" edc:name="DMA4PR2" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-----nnn" edc:cname="DMA5PR" edc:desc="" edc:impl="0x7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----111" edc:name="DMA5PR" edc:nzwidth="8" edc:por="-----111" edc:_addr="0xBA">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PR" edc:mask="0x7" edc:name="PR" edc:nzwidth="3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="PR0" edc:mask="0x1" edc:name="PR0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PR1" edc:mask="0x1" edc:name="PR1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PR2" edc:mask="0x1" edc:name="PR2" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="DMA5PR" edc:mask="0x7" edc:name="DMA5PR" edc:nzwidth="3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="DMA5PR0" edc:mask="0x1" edc:name="DMA5PR0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DMA5PR1" edc:mask="0x1" edc:name="DMA5PR1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DMA5PR2" edc:mask="0x1" edc:name="DMA5PR2" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-----nnn" edc:cname="DMA6PR" edc:desc="" edc:impl="0x7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----111" edc:name="DMA6PR" edc:nzwidth="8" edc:por="-----111" edc:_addr="0xBB">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PR" edc:mask="0x7" edc:name="PR" edc:nzwidth="3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="PR0" edc:mask="0x1" edc:name="PR0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PR1" edc:mask="0x1" edc:name="PR1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PR2" edc:mask="0x1" edc:name="PR2" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="DMA6PR" edc:mask="0x7" edc:name="DMA6PR" edc:nzwidth="3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="DMA6PR0" edc:mask="0x1" edc:name="DMA6PR0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DMA6PR1" edc:mask="0x1" edc:name="DMA6PR1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DMA6PR2" edc:mask="0x1" edc:name="DMA6PR2" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="0x2" edc:_addr="0xBC"/>
        <edc:SFRDef edc:access="-----nnn" edc:cname="MAINPR" edc:desc="" edc:impl="0x7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----111" edc:name="MAINPR" edc:nzwidth="8" edc:por="-----111" edc:_addr="0xBE">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PR" edc:mask="0x7" edc:name="PR" edc:nzwidth="3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="PR0" edc:mask="0x1" edc:name="PR0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PR1" edc:mask="0x1" edc:name="PR1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PR2" edc:mask="0x1" edc:name="PR2" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="MAINPR" edc:mask="0x7" edc:name="MAINPR" edc:nzwidth="3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="MAINPR0" edc:mask="0x1" edc:name="MAINPR0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="MAINPR1" edc:mask="0x1" edc:name="MAINPR1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="MAINPR2" edc:mask="0x1" edc:name="MAINPR2" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-----nnn" edc:cname="ISRPR" edc:desc="" edc:impl="0x7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----111" edc:name="ISRPR" edc:nzwidth="8" edc:por="-----111" edc:_addr="0xBF">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PR" edc:mask="0x7" edc:name="PR" edc:nzwidth="3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="PR0" edc:mask="0x1" edc:name="PR0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PR1" edc:mask="0x1" edc:name="PR1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PR2" edc:mask="0x1" edc:name="PR2" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="ISRPR" edc:mask="0x7" edc:name="ISRPR" edc:nzwidth="3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="ISRPR0" edc:mask="0x1" edc:name="ISRPR0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ISRPR1" edc:mask="0x1" edc:name="ISRPR1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ISRPR2" edc:mask="0x1" edc:name="ISRPR2" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="0x14" edc:_addr="0xC0"/>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="CLCDATA" edc:desc="" edc:impl="0x80" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="CLCDATA" edc:nzwidth="8" edc:por="00000000" edc:_addr="0xD4">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CLC1OUT" edc:mask="0x1" edc:name="CLC1OUT" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLC2OUT" edc:mask="0x1" edc:name="CLC2OUT" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLC3OUT" edc:mask="0x1" edc:name="CLC3OUT" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLC4OUT" edc:mask="0x1" edc:name="CLC4OUT" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLC5OUT" edc:mask="0x1" edc:name="CLC5OUT" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLC6OUT" edc:mask="0x1" edc:name="CLC6OUT" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLC7OUT" edc:mask="0x1" edc:name="CLC7OUT" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLC8OUT" edc:mask="0x1" edc:name="CLC8OUT" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-----nnn" edc:cname="CLCSELECT" edc:desc="" edc:impl="0x7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----000" edc:name="CLCSELECT" edc:nzwidth="8" edc:por="-----000" edc:_modsrc="DOS-02286_cla_clc_v5_8bit_stacked.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xb" edc:_addr="0xD5">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SLCT" edc:mask="0x7" edc:name="SLCT" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="SLCT0" edc:mask="0x1" edc:name="SLCT0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SLCT1" edc:mask="0x1" edc:name="SLCT1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SLCT2" edc:mask="0x1" edc:name="SLCT2" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnrnnnnn" edc:cname="CLCnCON" edc:desc="Configurable logic cell control" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="CLCnCON" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-02286_cla_clc_v5_8bit_stacked.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xb" edc:_addr="0xD6">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="MODE" edc:desc="" edc:mask="0x7" edc:name="MODE" edc:nzwidth="3"/>
              <edc:SFRFieldDef edc:cname="INTN" edc:desc="" edc:mask="0x1" edc:name="INTN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="INTP" edc:desc="" edc:mask="0x1" edc:name="INTP" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OUT" edc:desc="" edc:mask="0x1" edc:name="OUT" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OE" edc:desc="" edc:mask="0x1" edc:name="OE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EN" edc:desc="" edc:mask="0x1" edc:name="EN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="MODE0" edc:mask="0x1" edc:name="MODE0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="MODE1" edc:mask="0x1" edc:name="MODE1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="MODE2" edc:mask="0x1" edc:name="MODE2" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="n---nnnn" edc:cname="CLCnPOL" edc:desc="Polarity control" edc:impl="0x8f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0---uuuu" edc:name="CLCnPOL" edc:nzwidth="8" edc:por="0---xxxx" edc:_modsrc="DOS-02286_cla_clc_v5_8bit_stacked.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xb" edc:_addr="0xD7">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="G1POL" edc:desc="" edc:mask="0x1" edc:name="G1POL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G2POL" edc:desc="" edc:mask="0x1" edc:name="G2POL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G3POL" edc:desc="" edc:mask="0x1" edc:name="G3POL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G4POL" edc:desc="" edc:mask="0x1" edc:name="G4POL" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="POL" edc:desc="" edc:mask="0x1" edc:name="POL" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="CLCnSEL0" edc:desc="Input select register 1" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="CLCnSEL0" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-02286_cla_clc_v5_8bit_stacked.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xb" edc:_addr="0xD8">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="D1S" edc:desc="" edc:mask="0xff" edc:name="D1S" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="D1S0" edc:desc="" edc:mask="0x1" edc:name="D1S0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="D1S1" edc:desc="" edc:mask="0x1" edc:name="D1S1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="D1S2" edc:desc="" edc:mask="0x1" edc:name="D1S2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="D1S3" edc:desc="" edc:mask="0x1" edc:name="D1S3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="D1S4" edc:desc="" edc:mask="0x1" edc:name="D1S4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="D1S5" edc:desc="" edc:mask="0x1" edc:name="D1S5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="D1S6" edc:desc="" edc:mask="0x1" edc:name="D1S6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="D1S7" edc:desc="" edc:mask="0x1" edc:name="D1S7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="CLCnSEL1" edc:desc="Input select register 1" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="CLCnSEL1" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-02286_cla_clc_v5_8bit_stacked.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xb" edc:_addr="0xD9">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="D2S" edc:desc="" edc:mask="0xff" edc:name="D2S" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="D2S0" edc:mask="0x1" edc:name="D2S0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="D2S1" edc:mask="0x1" edc:name="D2S1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="D2S2" edc:mask="0x1" edc:name="D2S2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="D2S3" edc:mask="0x1" edc:name="D2S3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="D2S4" edc:mask="0x1" edc:name="D2S4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="D2S5" edc:mask="0x1" edc:name="D2S5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="D2S6" edc:mask="0x1" edc:name="D2S6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="D2S7" edc:mask="0x1" edc:name="D2S7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
