garyPenhook/PIC-Assembler/edc/PIC18F47Q43.PIC
          <edc:SFRDef edc:access="----nnnn" edc:cname="DMAnSSZH" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----0000" edc:name="DMAnSSZH" edc:nzwidth="8" edc:por="----0000" edc:_modsrc="DOS-03034_dma_8bit_v1_overlaid.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x18" edc:_addr="0xF8">
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="SSZ" edc:mask="0xf" edc:name="SSZ" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="SSZ8" edc:mask="0x1" edc:name="SSZ8" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SSZ9" edc:mask="0x1" edc:name="SSZ9" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SSZ10" edc:mask="0x1" edc:name="SSZ10" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SSZ11" edc:mask="0x1" edc:name="SSZ11" edc:nzwidth="0x1"/>
                <edc:AdjustPoint edc:offset="1"/>
                <edc:AdjustPoint edc:offset="1"/>
                <edc:AdjustPoint edc:offset="1"/>
                <edc:AdjustPoint edc:offset="1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:JoinedSFRDef edc:cname="DMAnSSA" edc:desc="DMA source address register" edc:name="DMAnSSA" edc:nzwidth="0x10" edc:_modsrc="DOS-03034_dma_8bit_v1_overlaid.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x18" edc:_addr="0xF9">
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="DMAnSSAL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="DMAnSSAL" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-03034_dma_8bit_v1_overlaid.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x18" edc:_addr="0xF9">
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="SSA" edc:mask="0xff" edc:name="SSA" edc:nzwidth="0x8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="SSA0" edc:mask="0x1" edc:name="SSA0" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SSA1" edc:mask="0x1" edc:name="SSA1" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SSA2" edc:mask="0x1" edc:name="SSA2" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SSA3" edc:mask="0x1" edc:name="SSA3" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SSA4" edc:mask="0x1" edc:name="SSA4" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SSA5" edc:mask="0x1" edc:name="SSA5" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SSA6" edc:mask="0x1" edc:name="SSA6" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SSA7" edc:mask="0x1" edc:name="SSA7" edc:nzwidth="0x1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="DMAnSSAH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="DMAnSSAH" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-03034_dma_8bit_v1_overlaid.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x18" edc:_addr="0xFA">
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="SSA" edc:mask="0xff" edc:name="SSA" edc:nzwidth="0x8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="SSA8" edc:mask="0x1" edc:name="SSA8" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SSA9" edc:mask="0x1" edc:name="SSA9" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SSA10" edc:mask="0x1" edc:name="SSA10" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SSA11" edc:mask="0x1" edc:name="SSA11" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SSA12" edc:mask="0x1" edc:name="SSA12" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SSA13" edc:mask="0x1" edc:name="SSA13" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SSA14" edc:mask="0x1" edc:name="SSA14" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SSA15" edc:mask="0x1" edc:name="SSA15" edc:nzwidth="0x1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="--nnnnnn" edc:cname="DMAnSSAU" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--000000" edc:name="DMAnSSAU" edc:nzwidth="8" edc:por="--000000" edc:_modsrc="DOS-03034_dma_8bit_v1_overlaid.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x18" edc:_addr="0xFB">
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="SSA" edc:mask="0x3f" edc:name="SSA" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="SSA16" edc:mask="0x1" edc:name="SSA16" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SSA17" edc:mask="0x1" edc:name="SSA17" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SSA18" edc:mask="0x1" edc:name="SSA18" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SSA19" edc:mask="0x1" edc:name="SSA19" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SSA20" edc:mask="0x1" edc:name="SSA20" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SSA21" edc:mask="0x1" edc:name="SSA21" edc:nzwidth="0x1"/>
                <edc:AdjustPoint edc:offset="1"/>
                <edc:AdjustPoint edc:offset="1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:SFRDef edc:access="nnn--n-r" edc:cname="DMAnCON0" edc:desc="DMA control register 0" edc:impl="0xe5" edc:isindirect="false" edc:isvolatile="true" edc:mclr="000--0-0" edc:name="DMAnCON0" edc:nzwidth="8" edc:por="000--0-0" edc:_modsrc="DOS-03034_dma_8bit_v1_overlaid.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x18" edc:_addr="0xFC">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="XIP" edc:mask="0x1" edc:name="XIP" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="AIRQEN" edc:mask="0x1" edc:name="AIRQEN" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="DGO" edc:mask="0x1" edc:name="DGO" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SIRQEN" edc:mask="0x1" edc:name="SIRQEN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EN" edc:mask="0x1" edc:name="EN" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="DMAnCON1" edc:desc="DMA control register 1" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="DMAnCON1" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-03034_dma_8bit_v1_overlaid.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x18" edc:_addr="0xFD">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SSTP" edc:mask="0x1" edc:name="SSTP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SMODE" edc:mask="0x3" edc:name="SMODE" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="SMR" edc:mask="0x3" edc:name="SMR" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="DSTP" edc:mask="0x1" edc:name="DSTP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DMODE" edc:mask="0x3" edc:name="DMODE" edc:nzwidth="0x2"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
