garyPenhook/PIC-Assembler/edc/PIC18F47Q43.PIC
        <edc:SFRDef edc:access="---nnnnn" edc:cname="T1GPPS" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="T1GPPS" edc:nzwidth="8" edc:por="---01101" edc:_modsrc="DOS-xxxx_pps_mid_v3_input_Q43_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x3f" edc:_addr="0x243">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PIN" edc:mask="0x7" edc:name="PIN" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="PORT" edc:mask="0x3" edc:name="PORT" edc:nzwidth="2"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="T1GPPS0" edc:mask="0x1" edc:name="T1GPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T1GPPS1" edc:mask="0x1" edc:name="T1GPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T1GPPS2" edc:mask="0x1" edc:name="T1GPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T1GPPS3" edc:mask="0x1" edc:name="T1GPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T1GPPS4" edc:mask="0x1" edc:name="T1GPPS0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="T1GPPS" edc:mask="0x1f" edc:name="T1GPPS" edc:nzwidth="5"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="T3CKIPPS" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--uuuuuu" edc:name="T3CKIPPS" edc:nzwidth="8" edc:por="--010000" edc:_modsrc="DOS-xxxx_pps_mid_v3_input_Q43_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x3f" edc:_addr="0x244">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PIN" edc:mask="0x7" edc:name="PIN" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="PORT" edc:mask="0x7" edc:name="PORT" edc:nzwidth="3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="T3CKIPPS0" edc:mask="0x1" edc:name="T3CKIPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T3CKIPPS1" edc:mask="0x1" edc:name="T3CKIPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T3CKIPPS2" edc:mask="0x1" edc:name="T3CKIPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T3CKIPPS3" edc:mask="0x1" edc:name="T3CKIPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T3CKIPPS4" edc:mask="0x1" edc:name="T3CKIPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T3CKIPPS5" edc:mask="0x1" edc:name="T3CKIPPS5" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="T3CKIPPS" edc:mask="0x3f" edc:name="T3CKIPPS" edc:nzwidth="6"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="T3GPPS" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="T3GPPS" edc:nzwidth="8" edc:por="---10000" edc:_modsrc="DOS-xxxx_pps_mid_v3_input_Q43_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x3f" edc:_addr="0x245">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PIN" edc:mask="0x7" edc:name="PIN" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="PORT" edc:mask="0x3" edc:name="PORT" edc:nzwidth="2"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="T3GPPS0" edc:mask="0x1" edc:name="T3GPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T3GPPS1" edc:mask="0x1" edc:name="T3GPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T3GPPS2" edc:mask="0x1" edc:name="T3GPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T3GPPS3" edc:mask="0x1" edc:name="T3GPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T3GPPS4" edc:mask="0x1" edc:name="T3GPPS0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="T3GPPS" edc:mask="0x1f" edc:name="T3GPPS" edc:nzwidth="5"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="T5CKIPPS" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--uuuuuu" edc:name="T5CKIPPS" edc:nzwidth="8" edc:por="--010010" edc:_modsrc="DOS-xxxx_pps_mid_v3_input_Q43_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x3f" edc:_addr="0x246">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PIN" edc:mask="0x7" edc:name="PIN" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="PORT" edc:mask="0x7" edc:name="PORT" edc:nzwidth="3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="T5CKIPPS0" edc:mask="0x1" edc:name="T5CKIPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T5CKIPPS1" edc:mask="0x1" edc:name="T5CKIPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T5CKIPPS2" edc:mask="0x1" edc:name="T5CKIPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T5CKIPPS3" edc:mask="0x1" edc:name="T5CKIPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T5CKIPPS4" edc:mask="0x1" edc:name="T5CKIPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T5CKIPPS5" edc:mask="0x1" edc:name="T5CKIPPS5" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="T5CKIPPS" edc:mask="0x3f" edc:name="T5CKIPPS" edc:nzwidth="6"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="T5GPPS" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="T5GPPS" edc:nzwidth="8" edc:por="---01100" edc:_modsrc="DOS-xxxx_pps_mid_v3_input_Q43_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x3f" edc:_addr="0x247">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PIN" edc:mask="0x7" edc:name="PIN" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="PORT" edc:mask="0x3" edc:name="PORT" edc:nzwidth="2"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="T5GPPS0" edc:mask="0x1" edc:name="T5GPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T5GPPS1" edc:mask="0x1" edc:name="T5GPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T5GPPS2" edc:mask="0x1" edc:name="T5GPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T5GPPS3" edc:mask="0x1" edc:name="T5GPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T5GPPS4" edc:mask="0x1" edc:name="T5GPPS0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="T5GPPS" edc:mask="0x1f" edc:name="T5GPPS" edc:nzwidth="5"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="T2INPPS" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="T2INPPS" edc:nzwidth="8" edc:por="---10011" edc:_modsrc="DOS-xxxx_pps_mid_v3_input_Q43_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x3f" edc:_addr="0x248">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PIN" edc:mask="0x7" edc:name="PIN" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="PORT" edc:mask="0x3" edc:name="PORT" edc:nzwidth="2"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="T2INPPS0" edc:mask="0x1" edc:name="T2INPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T2INPPS1" edc:mask="0x1" edc:name="T2INPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T2INPPS2" edc:mask="0x1" edc:name="T2INPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T2INPPS3" edc:mask="0x1" edc:name="T2INPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T2INPPS4" edc:mask="0x1" edc:name="T2INPPS4" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="T2INPPS" edc:mask="0x1f" edc:name="T2INPPS" edc:nzwidth="5"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
