garyPenhook/PIC-Assembler/edc/PIC18F47Q43.PIC
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="IPR10" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="IPR10" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-xxxx_Interrupts_Q43_PIE_IPR_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0x36C">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="INT2IP" edc:mask="0x1" edc:name="INT2IP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLC5IP" edc:mask="0x1" edc:name="CLC5IP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CWG2IP" edc:mask="0x1" edc:name="CWG2IP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="NCO2IP" edc:mask="0x1" edc:name="NCO2IP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DMA3SCNTIP" edc:mask="0x1" edc:name="DMA3SCNTIP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DMA3DCNTIP" edc:mask="0x1" edc:name="DMA3DCNTIP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DMA3ORIP" edc:mask="0x1" edc:name="DMA3ORIP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DMA3AIP" edc:mask="0x1" edc:name="DMA3AIP" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="IPR11" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="IPR11" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-xxxx_Interrupts_Q43_PIE_IPR_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0x36D">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CCP3IP" edc:mask="0x1" edc:name="CCP3IP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLC6IP" edc:mask="0x1" edc:name="CLC6IP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CWG3IP" edc:mask="0x1" edc:name="CWG3IP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR4IP" edc:mask="0x1" edc:name="TMR4IP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DMA4SCNTIP" edc:mask="0x1" edc:name="DMA4SCNTIP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DMA4DCNTIP" edc:mask="0x1" edc:name="DMA4DCNTIP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DMA4ORIP" edc:mask="0x1" edc:name="DMA4ORIP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DMA4AIP" edc:mask="0x1" edc:name="DMA4AIP" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="IPR12" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="IPR12" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-xxxx_Interrupts_Q43_PIE_IPR_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0x36E">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="U4RXIP" edc:mask="0x1" edc:name="U4RXIP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U4TXIP" edc:mask="0x1" edc:name="U4TXIP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U4EIP" edc:mask="0x1" edc:name="U4EIP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U4IP" edc:mask="0x1" edc:name="U4IP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DMA5SCNTIP" edc:mask="0x1" edc:name="DMA5SCNTIP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DMA5DCNTIP" edc:mask="0x1" edc:name="DMA5DCNTIP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DMA5ORIP" edc:mask="0x1" edc:name="DMA5ORIP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DMA5AIP" edc:mask="0x1" edc:name="DMA5AIP" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="IPR13" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="IPR13" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-xxxx_Interrupts_Q43_PIE_IPR_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0x36F">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="U5RXIP" edc:mask="0x1" edc:name="U5RXIP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U5TXIP" edc:mask="0x1" edc:name="U5TXIP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U5EIP" edc:mask="0x1" edc:name="U5EIP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U5IP" edc:mask="0x1" edc:name="U5IP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DMA6SCNTIP" edc:mask="0x1" edc:name="DMA6SCNTIP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DMA6DCNTIP" edc:mask="0x1" edc:name="DMA6DCNTIP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DMA6ORIP" edc:mask="0x1" edc:name="DMA6ORIP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DMA6AIP" edc:mask="0x1" edc:name="DMA6AIP" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="----nnn-" edc:cname="IPR14" edc:desc="" edc:impl="0xe" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----uuu-" edc:name="IPR14" edc:nzwidth="8" edc:por="----xxx-" edc:_modsrc="DOS-xxxx_Interrupts_Q43_PIE_IPR_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0x370">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="CLC7IP" edc:mask="0x1" edc:name="CLC7IP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="C2IP" edc:mask="0x1" edc:name="C2IP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="NCO3IP" edc:mask="0x1" edc:name="NCO3IP" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x3"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="----nnnn" edc:cname="IPR15" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----uuuu" edc:name="IPR15" edc:nzwidth="8" edc:por="----xxxx" edc:_modsrc="DOS-xxxx_Interrupts_Q43_PIE_IPR_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0x371">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="NVMIP" edc:mask="0x1" edc:name="NVMIP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLC8IP" edc:mask="0x1" edc:name="CLC8IP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CRCIP" edc:mask="0x1" edc:name="CRCIP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR6IP" edc:mask="0x1" edc:name="TMR6IP" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="0x1" edc:_addr="0x372"/>
        <edc:SFRDef edc:access="-rrnnnnn" edc:cname="STATUS_CSHAD" edc:desc="" edc:impl="0x7f" edc:isindirect="false" edc:isvolatile="false" edc:mclr="-qquuuuu" edc:name="STATUS_CSHAD" edc:nzwidth="0x8" edc:por="-1100000" edc:_addr="0x373">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="C" edc:desc="" edc:mask="0x1" edc:name="C" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DC" edc:desc="" edc:mask="0x1" edc:name="DC" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="Z" edc:desc="" edc:mask="0x1" edc:name="Z" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OV" edc:desc="" edc:mask="0x1" edc:name="OV" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="N" edc:desc="" edc:mask="0x1" edc:name="N" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="nPD" edc:mask="0x1" edc:name="nPD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="nTO" edc:mask="0x1" edc:name="nTO" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="0x5"/>
              <edc:SFRFieldDef edc:cname="PD" edc:mask="0x1" edc:name="PD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TO" edc:mask="0x1" edc:name="TO" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="WREG_CSHAD" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="false" edc:mclr="uuuuuuuu" edc:name="WREG_CSHAD" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0x374">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="WREG" edc:desc="" edc:mask="0xff" edc:name="WREG" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="BSR_CSHAD" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="false" edc:mclr="--000000" edc:name="BSR_CSHAD" edc:nzwidth="0x8" edc:por="--000000" edc:_addr="0x375">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="BSR" edc:desc="" edc:islanghidden="true" edc:mask="0x3f" edc:name="BSR" edc:nzwidth="6"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-------n" edc:cname="SHADCON" edc:desc="" edc:impl="0x1" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-------0" edc:name="SHADCON" edc:nzwidth="8" edc:por="-------0" edc:_addr="0x376">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SHADLO" edc:mask="0x1" edc:name="SHADLO" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-rrnnnnn" edc:cname="STATUS_SHAD" edc:desc="" edc:impl="0x7f" edc:isindirect="false" edc:isvolatile="false" edc:mclr="-qquuuuu" edc:name="STATUS_SHAD" edc:nzwidth="0x8" edc:por="-1100000" edc:_addr="0x377">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="C" edc:desc="" edc:mask="0x1" edc:name="C" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DC" edc:desc="" edc:mask="0x1" edc:name="DC" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="Z" edc:desc="" edc:mask="0x1" edc:name="Z" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OV" edc:desc="" edc:mask="0x1" edc:name="OV" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="N" edc:desc="" edc:mask="0x1" edc:name="N" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="nPD" edc:mask="0x1" edc:name="nPD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="nTO" edc:mask="0x1" edc:name="nTO" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="0x5"/>
              <edc:SFRFieldDef edc:cname="PD" edc:mask="0x1" edc:name="PD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TO" edc:mask="0x1" edc:name="TO" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="WREG_SHAD" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="false" edc:mclr="uuuuuuuu" edc:name="WREG_SHAD" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0x378">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="WREG" edc:desc="" edc:mask="0xff" edc:name="WREG" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="BSR_SHAD" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="false" edc:mclr="--000000" edc:name="BSR_SHAD" edc:nzwidth="0x8" edc:por="--000000" edc:_addr="0x379">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="BSR" edc:desc="" edc:islanghidden="true" edc:mask="0x3f" edc:name="BSR" edc:nzwidth="6"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PCLATH_SHAD" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="PCLATH_SHAD" edc:nzwidth="0x8" edc:por="00000000" edc:_addr="0x37A">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PCH" edc:desc="" edc:mask="0xff" edc:name="PCH" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="PCLATU_SHAD" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000" edc:name="PCLATU_SHAD" edc:nzwidth="0x8" edc:por="---00000" edc:_addr="0x37B">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PCU" edc:mask="0x1f" edc:name="PCU" edc:nzwidth="5"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
