garyPenhook/PIC-Assembler/edc/PIC18F47Q43.PIC
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="IOCCP" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="IOCCP" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-xxxxx_port_control_xxK42_8bit.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x415">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="IOCCP0" edc:mask="0x1" edc:name="IOCCP0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCCP1" edc:mask="0x1" edc:name="IOCCP1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCCP2" edc:mask="0x1" edc:name="IOCCP2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCCP3" edc:mask="0x1" edc:name="IOCCP3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCCP4" edc:mask="0x1" edc:name="IOCCP4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCCP5" edc:mask="0x1" edc:name="IOCCP5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCCP6" edc:mask="0x1" edc:name="IOCCP6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCCP7" edc:mask="0x1" edc:name="IOCCP7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="IOCCN" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="IOCCN" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-xxxxx_port_control_xxK42_8bit.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x416">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="IOCCN0" edc:mask="0x1" edc:name="IOCCN0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCCN1" edc:mask="0x1" edc:name="IOCCN0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCCN2" edc:mask="0x1" edc:name="IOCCN0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCCN3" edc:mask="0x1" edc:name="IOCCN0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCCN4" edc:mask="0x1" edc:name="IOCCN0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCCN5" edc:mask="0x1" edc:name="IOCCN0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCCN6" edc:mask="0x1" edc:name="IOCCN0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCCN7" edc:mask="0x1" edc:name="IOCCN0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="IOCCF" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="IOCCF" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-xxxxx_port_control_xxK42_8bit.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x417">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="IOCCF0" edc:mask="0x1" edc:name="IOCCF0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCCF1" edc:mask="0x1" edc:name="IOCCF0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCCF2" edc:mask="0x1" edc:name="IOCCF0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCCF3" edc:mask="0x1" edc:name="IOCCF0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCCF4" edc:mask="0x1" edc:name="IOCCF0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCCF5" edc:mask="0x1" edc:name="IOCCF0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCCF6" edc:mask="0x1" edc:name="IOCCF0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCCF7" edc:mask="0x1" edc:name="IOCCF0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="ANSELD" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="11111111" edc:name="ANSELD" edc:nzwidth="8" edc:por="11111111" edc:_modsrc="DOS-xxxxx_port_control_xxK42_8bit.Module" edc:_refcount="4" edc:_begin="0x0" edc:_end="0x5" edc:_addr="0x418">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ANSELD0" edc:mask="0x1" edc:name="ANSELD0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ANSELD1" edc:mask="0x1" edc:name="ANSELD0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ANSELD2" edc:mask="0x1" edc:name="ANSELD0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ANSELD3" edc:mask="0x1" edc:name="ANSELD0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ANSELD4" edc:mask="0x1" edc:name="ANSELD0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ANSELD5" edc:mask="0x1" edc:name="ANSELD0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ANSELD6" edc:mask="0x1" edc:name="ANSELD0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ANSELD7" edc:mask="0x1" edc:name="ANSELD0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="WPUD" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="WPUD" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-xxxxx_port_control_xxK42_8bit.Module" edc:_refcount="4" edc:_begin="0x0" edc:_end="0x5" edc:_addr="0x419">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="WPUD0" edc:mask="0x1" edc:name="WPUD0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WPUD1" edc:mask="0x1" edc:name="WPUD0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WPUD2" edc:mask="0x1" edc:name="WPUD0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WPUD3" edc:mask="0x1" edc:name="WPUD0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WPUD4" edc:mask="0x1" edc:name="WPUD0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WPUD5" edc:mask="0x1" edc:name="WPUD0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WPUD6" edc:mask="0x1" edc:name="WPUD0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WPUD7" edc:mask="0x1" edc:name="WPUD0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="ODCOND" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="ODCOND" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-xxxxx_port_control_xxK42_8bit.Module" edc:_refcount="4" edc:_begin="0x0" edc:_end="0x5" edc:_addr="0x41A">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ODCD0" edc:mask="0x1" edc:name="ODCD0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODCD1" edc:mask="0x1" edc:name="ODCD0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODCD2" edc:mask="0x1" edc:name="ODCD0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODCD3" edc:mask="0x1" edc:name="ODCD0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODCD4" edc:mask="0x1" edc:name="ODCD0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODCD5" edc:mask="0x1" edc:name="ODCD0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODCD6" edc:mask="0x1" edc:name="ODCD0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODCD7" edc:mask="0x1" edc:name="ODCD0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="SLRCOND" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="11111111" edc:name="SLRCOND" edc:nzwidth="8" edc:por="11111111" edc:_modsrc="DOS-xxxxx_port_control_xxK42_8bit.Module" edc:_refcount="4" edc:_begin="0x0" edc:_end="0x5" edc:_addr="0x41B">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SLRD0" edc:mask="0x1" edc:name="SLRD0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SLRD1" edc:mask="0x1" edc:name="SLRD0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SLRD2" edc:mask="0x1" edc:name="SLRD0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SLRD3" edc:mask="0x1" edc:name="SLRD0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SLRD4" edc:mask="0x1" edc:name="SLRD0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SLRD5" edc:mask="0x1" edc:name="SLRD0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SLRD6" edc:mask="0x1" edc:name="SLRD0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SLRD7" edc:mask="0x1" edc:name="SLRD0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="INLVLD" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="11111111" edc:name="INLVLD" edc:nzwidth="8" edc:por="11111111" edc:_modsrc="DOS-xxxxx_port_control_xxK42_8bit.Module" edc:_refcount="4" edc:_begin="0x0" edc:_end="0x5" edc:_addr="0x41C">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="INLVLD0" edc:mask="0x1" edc:name="INLVLD0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="INLVLD1" edc:mask="0x1" edc:name="INLVLD0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="INLVLD2" edc:mask="0x1" edc:name="INLVLD0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="INLVLD3" edc:mask="0x1" edc:name="INLVLD0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="INLVLD4" edc:mask="0x1" edc:name="INLVLD0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="INLVLD5" edc:mask="0x1" edc:name="INLVLD0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="INLVLD6" edc:mask="0x1" edc:name="INLVLD0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="INLVLD7" edc:mask="0x1" edc:name="INLVLD0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="0x3" edc:_addr="0x41D"/>
        <edc:SFRDef edc:access="-----nnn" edc:cname="ANSELE" edc:desc="" edc:impl="0x7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----111" edc:name="ANSELE" edc:nzwidth="8" edc:por="-----111" edc:_modsrc="DOS-xxxxx_port_control_xxK42_8bit.Module" edc:_refcount="5" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x420">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ANSELE0" edc:mask="0x1" edc:name="ANSELE0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ANSELE1" edc:mask="0x1" edc:name="ANSELE0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ANSELE2" edc:mask="0x1" edc:name="ANSELE0" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="----nnnn" edc:cname="WPUE" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----0000" edc:name="WPUE" edc:nzwidth="8" edc:por="----0000" edc:_modsrc="DOS-xxxxx_port_control_xxK42_8bit.Module" edc:_refcount="5" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x421">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="WPUE0" edc:mask="0x1" edc:name="WPUE0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WPUE1" edc:mask="0x1" edc:name="WPUE0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WPUE2" edc:mask="0x1" edc:name="WPUE0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WPUE3" edc:mask="0x1" edc:name="WPUE0" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-----nnn" edc:cname="ODCONE" edc:desc="" edc:impl="0x7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----000" edc:name="ODCONE" edc:nzwidth="8" edc:por="-----000" edc:_modsrc="DOS-xxxxx_port_control_xxK42_8bit.Module" edc:_refcount="5" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x422">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ODCE0" edc:mask="0x1" edc:name="ODCE0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODCE1" edc:mask="0x1" edc:name="ODCE0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODCE2" edc:mask="0x1" edc:name="ODCE0" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-----nnn" edc:cname="SLRCONE" edc:desc="" edc:impl="0x7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----111" edc:name="SLRCONE" edc:nzwidth="8" edc:por="-----111" edc:_modsrc="DOS-xxxxx_port_control_xxK42_8bit.Module" edc:_refcount="5" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x423">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SLRE0" edc:mask="0x1" edc:name="SLRE0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SLRE1" edc:mask="0x1" edc:name="SLRE0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SLRE2" edc:mask="0x1" edc:name="SLRE0" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="----nnnn" edc:cname="INLVLE" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----1111" edc:name="INLVLE" edc:nzwidth="8" edc:por="----1111" edc:_modsrc="DOS-xxxxx_port_control_xxK42_8bit.Module" edc:_refcount="5" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x424">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="INLVLE0" edc:mask="0x1" edc:name="INLVLE0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="INLVLE1" edc:mask="0x1" edc:name="INLVLE0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="INLVLE2" edc:mask="0x1" edc:name="INLVLE0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="INLVLE3" edc:mask="0x1" edc:name="INLVLE0" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="----n---" edc:cname="IOCEP" edc:desc="" edc:impl="0x8" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----0---" edc:name="IOCEP" edc:nzwidth="8" edc:por="----0---" edc:_modsrc="DOS-xxxxx_port_control_xxK42_8bit.Module" edc:_refcount="5" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x425">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="IOCEP3" edc:mask="0x1" edc:name="IOCEP3" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
