garyPenhook/PIC-Assembler/edc/PIC18F47Q43.PIC
          <edc:SFRDef edc:access="----nnnn" edc:cname="NCO2INCU" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----0000" edc:name="NCO2INCU" edc:nzwidth="8" edc:por="----0000" edc:_modsrc="DOS-02547_tmr_dds_v2_generic.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x44D">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="INC" edc:desc="" edc:mask="0xf" edc:name="INC" edc:nzwidth="4"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="NCO2INC16" edc:desc="" edc:mask="0x1" edc:name="NCO2INC16" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="NCO2INC17" edc:desc="" edc:mask="0x1" edc:name="NCO2INC17" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="NCO2INC18" edc:desc="" edc:mask="0x1" edc:name="NCO2INC18" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="NCO2INC19" edc:desc="" edc:mask="0x1" edc:name="NCO2INC19" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="INC16" edc:mask="0x1" edc:name="INC16" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="INC17" edc:mask="0x1" edc:name="INC17" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="INC18" edc:mask="0x1" edc:name="INC18" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="INC19" edc:mask="0x1" edc:name="INC19" edc:nzwidth="0x1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.2">
                <edc:SFRFieldDef edc:cname="NCO2INC" edc:mask="0xf" edc:name="NCO2INC" edc:nzwidth="4"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:SFRDef edc:access="n-rn---n" edc:cname="NCO2CON" edc:desc="Configurable logic cell control" edc:impl="0xb1" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0-00---0" edc:name="NCO2CON" edc:nzwidth="8" edc:por="0-00---0" edc:_modsrc="DOS-02547_tmr_dds_v2_generic.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x44E">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PFM" edc:desc="" edc:mask="0x1" edc:name="PFM" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="POL" edc:desc="" edc:mask="0x1" edc:name="POL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OUT" edc:desc="" edc:mask="0x1" edc:name="OUT" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="EN" edc:desc="" edc:mask="0x1" edc:name="EN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="NCO2PFM" edc:mask="0x1" edc:name="NCO2PFM" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x3"/>
              <edc:SFRFieldDef edc:cname="NCO2POL" edc:mask="0x1" edc:name="NCO2POL" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="NCO2OUT" edc:mask="0x1" edc:name="NCO2OUT" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="NCO2EN" edc:mask="0x1" edc:name="NCO2EN" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="NCO2CLK" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="NCO2CLK" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-02547_tmr_dds_v2_generic.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x44F">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CKS" edc:desc="" edc:mask="0x1f" edc:name="CKS" edc:nzwidth="5"/>
              <edc:SFRFieldDef edc:cname="PWS" edc:desc="" edc:mask="0x7" edc:name="PWS" edc:nzwidth="3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="CKS0" edc:mask="0x1" edc:name="CKS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CKS1" edc:mask="0x1" edc:name="CKS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CKS2" edc:mask="0x1" edc:name="CKS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CKS3" edc:mask="0x1" edc:name="CKS3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CKS4" edc:mask="0x1" edc:name="CKS4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PWS0" edc:mask="0x1" edc:name="PWS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PWS1" edc:mask="0x1" edc:name="PWS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PWS2" edc:mask="0x1" edc:name="PWS2" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="NCO2CKS" edc:mask="0x1f" edc:name="NCO2CKS" edc:nzwidth="5"/>
              <edc:SFRFieldDef edc:cname="NCO2PWS" edc:mask="0x7" edc:name="NCO2PWS" edc:nzwidth="0x3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="NCO2CKS0" edc:mask="0x1" edc:name="NCO2CKS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="NCO2CKS1" edc:mask="0x1" edc:name="NCO2CKS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="NCO2CKS2" edc:mask="0x1" edc:name="NCO2CKS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="NCO2CKS3" edc:mask="0x1" edc:name="NCO2CKS3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="NCO2CKS4" edc:mask="0x1" edc:name="NCO2CKS4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="NCO2PWS0" edc:mask="0x1" edc:name="NCO2PWS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="NCO2PWS1" edc:mask="0x1" edc:name="NCO2PWS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="NCO2PWS2" edc:mask="0x1" edc:name="NCO2PWS2" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:JoinedSFRDef edc:cname="NCO3ACC" edc:desc="" edc:name="NCO3ACC" edc:nzwidth="0x18" edc:_modsrc="DOS-02547_tmr_dds_v2_generic.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x450">
          <edc:SFRModeList/>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="NCO3ACCL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="NCO3ACCL" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-02547_tmr_dds_v2_generic.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x450">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="ACC" edc:desc="" edc:mask="0xff" edc:name="ACC" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="NCO3ACC0" edc:desc="" edc:mask="0x1" edc:name="NCO3ACC0" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="NCO3ACC1" edc:desc="" edc:mask="0x1" edc:name="NCO3ACC1" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="NCO3ACC2" edc:desc="" edc:mask="0x1" edc:name="NCO3ACC2" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="NCO3ACC3" edc:desc="" edc:mask="0x1" edc:name="NCO3ACC3" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="NCO3ACC4" edc:desc="" edc:mask="0x1" edc:name="NCO3ACC4" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="NCO3ACC5" edc:desc="" edc:mask="0x1" edc:name="NCO3ACC5" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="NCO3ACC6" edc:desc="" edc:mask="0x1" edc:name="NCO3ACC6" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="NCO3ACC7" edc:desc="" edc:mask="0x1" edc:name="NCO3ACC7" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="ACC0" edc:mask="0x1" edc:name="ACC0" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ACC1" edc:mask="0x1" edc:name="ACC1" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ACC2" edc:mask="0x1" edc:name="ACC2" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ACC3" edc:mask="0x1" edc:name="ACC3" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ACC4" edc:mask="0x1" edc:name="ACC4" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ACC5" edc:mask="0x1" edc:name="ACC5" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ACC6" edc:mask="0x1" edc:name="ACC6" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ACC7" edc:mask="0x1" edc:name="ACC7" edc:nzwidth="0x1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.2">
                <edc:SFRFieldDef edc:cname="NCO3ACC" edc:mask="0xff" edc:name="NCO3ACC" edc:nzwidth="0x8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
